code/openfoam/tutorials/incompressibleFluid/turbineSiting/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [turbulentViscosity];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 0;
    }

    outlet
    {
        type            calculated;
        value           uniform 0;
    }

    terrain
    {
        type            nutAtmosphericBoundaryLayerWallFunction;
        libs            ("libatmosphericModels.so");
        value           uniform 0;
    }

    ground
    {
        type            calculated;
        value           uniform 0;
    }

    #include "include/sideAndTopPatches"
}


// ************************************************************************* //
