code/openfoam/tutorials/incompressibleFluid/turbineSiting/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

vertices
(
    ( 581321  4.78537e+06   930)
    ( 582290  4.78537e+06   930)
    ( 582290  4.78624e+06   930)
    ( 581321  4.78624e+06   930)
    ( 581321  4.78537e+06   1500)
    ( 582290  4.78537e+06   1500)
    ( 582290  4.78624e+06   1500)
    ( 581321  4.78624e+06   1500)

);

blocks
(
    hex (0 1 2 3 4 5 6 7) (30 30 20) simpleGrading (1 1 1)
);

boundary
(
    outlet
    {
        type patch;
        faces
        (
            (2 6 5 1)
        );
    }
    sides
    {
        type patch;
        faces
        (
            (1 5 4 0)
            (3 7 6 2)
        );
    }
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    ground
    {
        type wall;
        faces
        (
            (0 3 2 1)
        );
    }
    top
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }
);



// ************************************************************************* //
